tutorials/Ramp/steady_SA/predict/reference/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1812                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    "(p|p_rgh|G)"
    {
        solver           GAMG;
        tolerance        0;
        relTol           0.1;
        smoother         GaussSeidel;
        maxIter          50;
        minIter          1;
    }


    "(U|T|e|h|nuTilda|k|omega|epsilon)"
    {
        solver          smoothSolver;
        smoother        GaussSeidel;
        tolerance       0;
        relTol          0.1;
        maxIter         50;
        minIter          1;
    }

}

relaxationFactors
{
    fields
    {
         "(p|p_rgh|G)"                   0.3;
    }
    equations
    {
        "(U|T|e|h|nuTilda|k|omega|epsilon)"                   0.7;
    }
}



// ************************************************************************* //
